app/controllers/productreviews_controller.rb

SELECT "productreviews".* FROM "productreviews"
SELECT "reviews".* FROM "reviews"
---
    def index
        productreviews = Productreview.all

INSERT INTO "productreviews" ("comment", "rating", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["comment", "12312"], ["rating", 123123], ["product_id", 1], ["created_at", "2021-09-14 20:38:27.735422"], ["updated_at", "2021-09-14 20:38:27.735422"]]
---
    def create
        productreview = Productreview.create(productreview_params)

SELECT "productreviews".* FROM "productreviews" WHERE "productreviews"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
DELETE FROM "productreviews" WHERE "productreviews"."id" = $1  [["id", 12]]
---
    def destroy
        review = Productreview.find(params[:id])
        review.destroy