app/controllers/reviews_controller.rb

    def create
        review = Review.create(review_params)
---
INSERT INTO "reviews" ("comment", "rating", "user_id", "workout_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["comment", "TEST"], ["rating", "9"], ["user_id", 1], ["workout_id", 1], ["created_at", "2021-09-09 22:20:18.469997"], ["updated_at", "2021-09-09 22:20:18.469997"]]

    def destroy
        review = Review.find(params[:id])
        review.destroy
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 4]]