app/controllers/workouts_controller.rb

    def index
        workouts = Workout.all
---
SELECT "workouts".* FROM "workouts"